Revit 2027 API
PanelScheduleView.MoveSlotTo Method
 Move the circuits in the source slot to the specific slot.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MoveSlotTo(
	int nMovingRow,
	int nMovingCol,
	int nToRow,
	int nToCol
)
Public Sub MoveSlotTo (
	nMovingRow As Integer,
	nMovingCol As Integer,
	nToRow As Integer,
	nToCol As Integer
)
public:
void MoveSlotTo(
	int nMovingRow,
	int nMovingCol,
	int nToRow,
	int nToCol
)
member MoveSlotTo :
        nMovingRow : int *
        nMovingCol : int *
        nToRow : int *
        nToCol : int -> unit
Parameters
nMovingRow Int32
 The Row Number of cell to be moved.
nMovingCol Int32
 Start Column Number of cell to be moved.
nToRow Int32
 The Row Number of cell to moved to.
nToCol Int32
 End Column Number of cell to moved to.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nMovingRow is invalid in Body. -or- The given column number nMovingCol is invalid in Body. -or- The given row number nToRow is invalid in Body. -or- The given column number nToCol is invalid in Body. -or- There is no circuit at given cell (nMovingRow, nMovingCol). -or- Cannot move the circuits at slot (nMovingRow, nMovingCol) to given slot (nToRow, nToCol).
Remarks
 If the moving circuit is in a group, all circuits in the group will be moved accordingly.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace